Autodesk.Revit.UI.ContextualHelpType
Represents the contextual help type.
Since: 2013

Autodesk.Revit.UI.ContextualHelpType.ChmFile
Represents the path to a file on disk. When users invoke help for this item, Revit will launch this file.

Autodesk.Revit.UI.ContextualHelpType.Url
Represents an arbitrary URL. When users invoke help for this item, Revit will load this URL into the user's default browser.

Autodesk.Revit.UI.ContextualHelpType.ContextId
Represents an Autodesk help context id, which will automatically be mapped to a URL in the Revit help system.

Autodesk.Revit.UI.ContextualHelpType.None
None.